### Data Wrangling

In [232]:
import pandas as pd
import numpy as np

In [233]:
url = 'https://tinyurl.com/titanic-csv'

In [234]:
df = pd.read_csv(url, na_values=[np.nan,'None', -999])

In [235]:
df2=df

In [236]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [237]:
df1 = pd.DataFrame()

In [238]:
df1['Name']=['Jacky Jackson', 'Steven Stephenson']

In [239]:
df1['Age']=[36, 25]

In [240]:
df1['Driver']=[True, False]

In [241]:
df1

                Name  Age  Driver
0      Jacky Jackson   36    True
1  Steven Stephenson   25   False

In [242]:
new_person = pd.Series(['Molly', 40, False], index=['Name', 'Age', 'Driver'])

In [243]:
df1.append(new_person, ignore_index=True)

                Name  Age  Driver
0      Jacky Jackson   36    True
1  Steven Stephenson   25   False
2              Molly   40   False

In [244]:
df.shape

(1313, 6)

In [245]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [246]:
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [247]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [248]:
df['Name'].iloc[:4]

0                     Allen, Miss Elisabeth Walton
1                      Allison, Miss Helen Loraine
2              Allison, Mr Hudson Joshua Creighton
3    Allison, Mrs Hudson JC (Bessie Waldo Daniels)
Name: Name, dtype: object

In [249]:
df[df['Sex'] == 'female'].iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1

In [250]:
df = df.set_index(df['Name'])

In [251]:
df.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [252]:
df[df['Sex']=='male'].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0
"Anderson, Mr Harry","Anderson, Mr Harry",1st,47.00,male,1,0
"Andrews, Mr Thomas, jr","Andrews, Mr Thomas, jr",1st,39.00,male,0,0
"Artagaveytia, Mr Ramon","Artagaveytia, Mr Ramon",1st,71.00,male,0,0

In [253]:
df[(df['Sex']=='female')&(df['Age']>50)].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
"Appleton, Mrs Edward Dale (Charlotte Lamson)","Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
"Bonnell, Miss Elizabeth","Bonnell, Miss Elizabeth",1st,58.0,female,1,1
"Brown, Mrs John Murray (Caroline Lane Lamson)","Brown, Mrs John Murray (Caroline Lane Lamson)",1st,59.0,female,1,1
"Bucknell, Mrs William Robert (Emma Eliza Ward)","Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.0,female,1,1

### Replacing Values

In [254]:
df['Sex'].replace('female', 'woman').head()

Name
Allen, Miss Elisabeth Walton                     woman
Allison, Miss Helen Loraine                      woman
Allison, Mr Hudson Joshua Creighton               male
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    woman
Allison, Master Hudson Trevor                     male
Name: Sex, dtype: object

#### Replace multiple values

In [255]:
df['Sex'].replace(['male', 'female'], ['man', 'woman']).head()

Name
Allen, Miss Elisabeth Walton                     woman
Allison, Miss Helen Loraine                      woman
Allison, Mr Hudson Joshua Creighton                man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    woman
Allison, Master Hudson Trevor                      man
Name: Sex, dtype: object

In [256]:
df.replace(r"1st", "First", regex=True).head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",First,0.92,male,1,0

#### Renaming Columns

In [257]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head()

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

#### Finding Min, Max, Sum, Average and Count

In [258]:
print('Maximun: ',df['Age'].max())
print('Minimum: ', df['Age'].min())
print('Sum: ', df['Age'].sum())
print('Average: ', df['Age'].mean())
print('Count: ', df['Age'].count())
print('Standard Deviation: ', df['Age'].std())
print('Variance: ', df['Age'].var())
print('Kurtosis: ', df['Age'].kurt())
print('Skewness: ', df['Age'].skew())
print('Standard error of mean: ', df['Age'].sem())
print('Mode: ', df['Age'].mode())
print('Median: ', df['Age'].median())

Maximun:  71.0
Minimum:  0.17
Sum:  22980.88
Average:  30.397989417989415
Count:  756
Standard Deviation:  14.259048710359023
Variance:  203.32047012439133
Kurtosis:  -0.036536168924722556
Skewness:  0.36851087371648295
Standard error of mean:  0.5185965877244657
Mode:  0    22.0
dtype: float64
Median:  28.0

#### Finding Unique Values

In [259]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [260]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [261]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

#### Handling Missing Values

In [262]:
df[df['Age'].isnull()].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0
"Baumann, Mr John D","Baumann, Mr John D",1st,NaN,male,0,0
"Borebank, Mr John James","Borebank, Mr John James",1st,NaN,male,0,0
"Bradley, Mr George","Bradley, Mr George",1st,NaN,male,1,0

###### Change certain strings to missing values (NaN)

In [263]:
df['Sex']=df['Sex'].replace('male', np.nan)

#### Deleting a Column

In [264]:
df.drop('Age', axis=1).head()

,Name,PClass,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,NaN,1,0

In [265]:
df.drop(['Age', 'SexCode'], axis=1).head()

,Name,PClass,Sex,Survived
Name,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,female,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,female,0
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,NaN,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,female,0
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,NaN,1

In [266]:
#Deleting a column by its index

In [267]:
df.drop(df.columns[1], axis=1).head()

,Name,Age,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",30.00,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",0.92,NaN,1,0

#### Deleting a Row

In [268]:
df[df['Sex'] != 'male'].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,NaN,1,0

In [269]:
df[df['Name']!= 'Allen, Miss Elisabeth Walton'].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,NaN,1,0
"Anderson, Mr Harry","Anderson, Mr Harry",1st,47.00,NaN,1,0

In [270]:
df[df.index != 0].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,NaN,1,0

In [271]:
df.drop_duplicates().head() #No rows were dropped as there were no duplicate values

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,NaN,1,0

In [272]:
print(len(df))
print(len(df.drop_duplicates()))

1313
1313

In [273]:
df[df['Sex'].duplicated()].head()  #Duplicated Rows in the dataframe

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,NaN,1,0
"Anderson, Mr Harry","Anderson, Mr Harry",1st,47.00,NaN,1,0
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1

In [274]:
df.drop_duplicates(subset=['Sex'])

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,NaN,0,0

In [275]:
df.drop_duplicates(subset=['Sex'], keep='last')

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Zabour, Miss Tamini","Zabour, Miss Tamini",3rd,NaN,female,0,1
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.0,NaN,0,0

### Grouping of Rows by value

In [281]:
df2.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [287]:
df2.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [288]:
df2.groupby(['Sex', 'Survived'])['Age'].count()

Sex     Survived
female  0            71
        1           217
male    0           372
        1            96
Name: Age, dtype: int64

### Grouping Rows by time

In [311]:
import pandas as pd
import numpy as np

In [312]:
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

In [313]:
df3 = pd.DataFrame(index=time_index)

In [314]:
df3.head()

Empty DataFrame
Columns: []
Index: [2017-06-06 00:00:00, 2017-06-06 00:00:30, 2017-06-06 00:01:00, 2017-06-06 00:01:30, 2017-06-06 00:02:00]

In [315]:
df3['Sale_Amount'] = np.random.randint(1,10,100000)

In [316]:
df3.resample('W').sum()

            Sale_Amount
2017-06-11        86807
2017-06-18       101730
2017-06-25       100263
2017-07-02       100437
2017-07-09       100735
2017-07-16        10499

In [317]:
df3.resample('2W').mean()

            Sale_Amount
2017-06-11     5.023553
2017-06-25     5.009747
2017-07-09     4.989385
2017-07-23     5.047596

In [319]:
df3.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

### Looping over columns

In [324]:
for name in df2['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [326]:
[name.upper() for name in df2['Name'][0:5]]

['ALLEN, MISS ELISABETH WALTON',
 'ALLISON, MISS HELEN LORAINE',
 'ALLISON, MR HUDSON JOSHUA CREIGHTON',
 'ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)',
 'ALLISON, MASTER HUDSON TREVOR']

### Applying a Function over all elements in a column

In [327]:
def uppercase(x):
    return x.upper()

In [328]:
df2['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

### Applying a function to a group

In [329]:
df2.groupby('Sex').apply(lambda x:x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

### Concatenating Dataframes

In [330]:
data_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}

In [331]:
df_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

In [332]:
df_a.head()

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali

In [333]:
data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}

In [334]:
df_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [335]:
df_b

  id  first     last
0  4  Billy   Bonder
1  5  Brian    Black
2  6   Bran  Balwner

In [339]:
pd.concat([df_a, df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [340]:
pd.concat([df_a, df_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [341]:
row=pd.Series([10, 'Chris', 'Chillion'], index=['id', 'first', 'last'])

In [344]:
df_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris  Chillion

### Merging DataFrames

In [345]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
                     'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
                     'Tim Horton']}

In [346]:
df_e = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

In [347]:
df_e

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

In [348]:
sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}

In [349]:
df_s = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

In [350]:
df_s

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [352]:
pd.merge(df_e, df_s, on='employee_id') #by default merge uses inner joins

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [354]:
pd.merge(df_e, df_s, on='employee_id', how='left') #left join

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

# Handling Numerical Data

In [355]:
#Rescale the values of numerical feature between two values

In [357]:
import numpy as np
from sklearn import preprocessing

In [358]:
feature = np.array([[-500.5],
                        [-100.1],
                        [0],
                        [100.1],
                        [900.9]])

In [360]:
minmax_scalar = preprocessing.MinMaxScaler(feature_range=(0,1))

In [363]:
scaled_feature = minmax_scalar.fit_transform(feature)

In [364]:
scaled_feature

array([[0.        ],
       [0.28571429],
       [0.35714286],
       [0.42857143],
       [1.        ]])

In [365]:
#http://sebastianraschka.com/Articles/2014_about_feature_scaling.html

### Standardizing a feature

In [366]:
#Transform a feature to have a mean of 0 and a standard deviation of 1

In [367]:
 x = np.array([[-1000.1],
                  [-200.2],
                  [500.5],
                  [600.6],
                  [9000.9]])

In [368]:
scalar = preprocessing.StandardScaler()

In [369]:
standardized = scalar.fit_transform(x)

In [370]:
standardized

array([[-0.76058269],
       [-0.54177196],
       [-0.35009716],
       [-0.32271504],
       [ 1.97516685]])

In [371]:
#Standardization is a common go-to scaling method for machine learning preprocessing 
#and in my experience is used more than min-max scaling. 
#However, it depends on the learning algorithm.

In [372]:
print("Mean:", round(standardized.mean())) 
print("Standard deviation:", standardized.std())

Mean: 0.0
Standard deviation: 1.0

In [373]:
#If our data has significant outliers, it can negatively impact our standardization by affecting the feature’s mean 
#and variance. In this scenario, it is often helpful to instead rescale the feature using the median and quartile range. 
#In scikit-learn, we do this using the RobustScaler method.

In [378]:
robust_scaler = preprocessing.RobustScaler()

In [379]:
robust_scaler.fit_transform(x)

array([[-1.87387612],
       [-0.875     ],
       [ 0.        ],
       [ 0.125     ],
       [10.61488511]])

#### Normalizing Observations

In [380]:
#Rescale the feature values of observations to have a unit form

In [381]:
from sklearn.preprocessing import Normalizer

In [385]:
features = np.array([[0.5, 0.5],
                         [1.1, 3.4],
                         [1.5, 20.2],
                         [1.63, 34.4],
                         [10.9, 3.3]])

In [388]:
normalizer = Normalizer(norm="l2")

In [389]:
normalizer.transform(features)

array([[0.70710678, 0.70710678],
       [0.30782029, 0.95144452],
       [0.07405353, 0.99725427],
       [0.04733062, 0.99887928],
       [0.95709822, 0.28976368]])

In [390]:
#Many rescaling methods (e.g., min-max scaling and standardization) operate on features; 
#however, we can also rescale across individual observations. 
#Normalizer rescales the values on individual observations to have unit norm (the sum of their lengths is 1). 
#This type of rescaling is often used when we have many equivalent features (e.g., text classification when every word or n-word group is a feature).

In [391]:
#Normalizer provides three norm options with Euclidean norm (often called L2) being the default argument

In [ ]:
![euclidean distance]()